{
  "Doxygen Template": {
  "prefix": "doxygen",
  "body": [
    "PROJECT_NAME           = @CMAKE_PROJECT_NAME@",
    "OUTPUT_DIRECTORY       = @CMAKE_CURRENT_SOURCE_DIR@/doc",
    "INPUT                  = @CMAKE_CURRENT_SOURCE_DIR@/src @CMAKE_CURRENT_SOURCE_DIR@/doc @CMAKE_CURRENT_SOURCE_DIR@",
    "",
    "EXCLUDE_PATTERNS      += */doc/* \\",
    "                         */build/* \\",
    "                         */include/* \\",
    "                         */attic/* \\",
    "                         */utest_* \\",
    "                         */test_* \\",
    "                         */demo_*",
    "",
    "# The RECURSIVE tag can be used to turn specify whether or not subdirectories ",
    "# should be searched for input files as well. Possible values are YES and NO. ",
    "# If left blank NO is used.",
    "",
    "RECURSIVE              = YES",
    "",
    "# If the EXTRACT_ALL tag is set to YES doxygen will assume all entities in ",
    "# documentation are documented, even if no documentation was available. ",
    "# Private class members and static file members will be hidden unless ",
    "# the EXTRACT_PRIVATE and EXTRACT_STATIC tags are set to YES",
    "",
    "EXTRACT_ALL            = YES",
    "",
    "# If the EXTRACT_PRIVATE tag is set to YES all private members of a class ",
    "# will be included in the documentation.",
    "",
    "EXTRACT_PRIVATE        = YES",
    "",
    "# If the EXTRACT_STATIC tag is set to YES all static members of a file ",
    "# will be included in the documentation.",
    "",
    "EXTRACT_STATIC         = YES",
    "",
    "# If the EXTRACT_LOCAL_CLASSES tag is set to YES classes (and structs) ",
    "# defined locally in source files will be included in the documentation. ",
    "# If set to NO only classes defined in header files are included.",
    "",
    "EXTRACT_LOCAL_CLASSES  = YES",
    "",
    "# If the SOURCE_BROWSER tag is set to YES then a list of source files will ",
    "# be generated. Documented entities will be cross-referenced with these sources. ",
    "# Note: To get rid of all source code in the generated output, make sure also ",
    "# VERBATIM_HEADERS is set to NO. If you have enabled CALL_GRAPH or CALLER_GRAPH ",
    "# then you must also enable this option. If you don't then doxygen will produce ",
    "# a warning and turn it on anyway",
    "",
    "SOURCE_BROWSER         = YES",
    "",
    "# Setting the INLINE_SOURCES tag to YES will include the body ",
    "# of functions and classes directly in the documentation.",
    "",
    "INLINE_SOURCES         = YES",
    "",
    "# If the INLINE_INFO tag is set to YES (the default) then a tag [inline] ",
    "# is inserted in the documentation for inline members.",
    "",
    "INLINE_INFO            = YES",
    "",
    "# The GENERATE_TODOLIST tag can be used to enable (YES) or ",
    "# disable (NO) the todo list. This list is created by putting \todo ",
    "# commands in the documentation.",
    "",
    "GENERATE_TODOLIST      = YES",
    "",
    "# The GENERATE_BUGLIST tag can be used to enable (YES) or ",
    "# disable (NO) the bug list. This list is created by putting \bug ",
    "# commands in the documentation.",
    "",
    "GENERATE_BUGLIST       = YES",
    "",
    "# The GENERATE_DEPRECATEDLIST tag can be used to enable (YES) or ",
    "# disable (NO) the deprecated list. This list is created by putting ",
    "# \\deprecated commands in the documentation.",
    "",
    "GENERATE_DEPRECATEDLIST= YES",
    "",
    "# Set the SHOW_USED_FILES tag to NO to disable the list of files generated ",
    "# at the bottom of the documentation of classes and structs. If set to YES the ",
    "# list will mention the files that were used to generate the documentation.",
    "",
    "SHOW_USED_FILES        = YES",
    "",
    "# If the CLASS_DIAGRAMS tag is set to YES (the default) Doxygen will ",
    "# generate a inheritance diagram (in HTML, RTF and LaTeX) for classes with base ",
    "# or super classes. Setting the tag to NO turns the diagrams off. Note that ",
    "# this option is superseded by the HAVE_DOT option below. This is only a ",
    "# fallback. It is recommended to install and use dot, since it yields more ",
    "# powerful graphs.",
    "",
    "CLASS_DIAGRAMS         = YES",
    "",
    "# If the FULL_PATH_NAMES tag is set to YES then Doxygen will prepend the full ",
    "# path before files name in the file list and in the header files. If set ",
    "# to NO the shortest path that makes the file name unique will be used.",
    "",
    "FULL_PATH_NAMES        = NO"
  ],
  "description": "Doxygen Template"
}
}
